[
{
	"title": "Sink not draining",
	"description": "The bathroom sink is clogged. It takes 2 hours to drain.",
	"location": "unit",
	"urgent": false,
	"solutions": [
		{
			"action": "Call a plumber",
			"outcome": "The plumber deftly unclogs the sink. She remarks that the pipes were lined with a glistening, almost-glowing material, but they're in good condition. The clog itself was typical build-up.",
			"cost": 200,
			"efficacy": 10,
			"time": 1,
			"impact": 1
		},
		{
			"action": "Use a plunger and drano",
			"outcome": "After leaving drano in the sink for several hours and coming back to plunge it, you successfully clear the drain. It's still a little slow, but you tell the tenant it will speed up in the next week.",
			"cost": 40,
			"efficacy": 7,
			"time": 3,
			"impact": 1
		},
		{
			"action": "Just use drano",
			"outcome": "You pick up some drano at the hardware store and pour it in the tenant's sink, then leave.",
			"cost": 15,
			"efficacy": 5,
			"time": 2,
			"impact": 0
		},
		{
			"action": "Tell tenant to use drano",
			"outcome": "The tenant acknowledges your text message.",
			"cost": 0,
		        "efficacy": 3,
			"time": 1,
			"impact": -1
		},
		{
			"action": "Improvise",
			"cost": 0,
			"efficacy": -1,
			"time": 2,
			"impact": -1
		}
	]
},
{
	"title": "Tub handle broken",
	"description": "The hot water handle on the tub has broken off. It can still be turned, but it is difficult due to the lack of a handle. Could you please put a new handle on the tub?",
	"location": "unit",
	"urgent": false,
	"solutions": [
		{
			"action": "Replace the entire tub spout",
			"outcome": "The fixture on the tub was pretty old so you aren't able to find an exact replacement, but the new one fits in its place perfectly and it seems to work fine. The tenant thanks you.",
			"cost": 75,
			"efficacy": 10,
			"time": 4,
			"impact": 1
		},
		{
			"action": "Improvise by gluing a laser pointer in the handle's place",
			"outcome": "This fits perfectly! No one will be able to tell the difference.",
			"cost": 0,
			"efficacy": -1,
			"time": 2,
			"impact": -1
		}
	]
},
{
	"title": "Window is not sealed",
	"description": "The window pane has come out of the frame and is open by about 2 inches at the widest point. Bugs and pests can easily come in.",
	"location": "unit",
	"urgent": true,
	"solutions": [
		{
			"action": "Hire a contractor to replace the window",
			"outcome": "TODO",
			"cost": 1000,
			"efficacy": 10,
			"time": 2,
			"impact": 1
		},
		{
			"action": "Replace the window",
			"outcome": "TODO",
			"cost": 700,
			"efficacy": 6,
			"time": 30,
			"impact": 1
		},
		{
			"action": "Remove window from the sill and caulk the pane back in place",
			"outcome": "TODO",
			"cost": 30,
			"efficacy": 4,
			"time": 16,
			"impact": -1
		},
		{
			"action": "Use tape to cover the opening",
			"outcome": "TODO",
			"cost": 5,
			"efficacy": -1,
			"time": 2,
			"impact": -2
		}
	]
},
{
	"title": "Washing machine is broken",
	"description": "The leftmost washing machine is broken. You can select settings and insert coins, but when you start it it just fills with water but doesn't spin.",
	"location": "basement",
	"urgent": false,
	"solutions": [
		{
			"action": "Call HappyWash to service the machine",
			"outcome": "TODO",
			"cost": 0,
			"efficacy": 8,
			"time": 1,
			"impact": 1
		},
		{
			"action": "Put an \"Out of Order\" sign on the machine",
			"outcome": "TODO",
			"cost": 0,
			"efficacy": -1,
			"time": 1,
			"impact": 0
		},
		{
			"action": "Tell tenant to call HappyWash to service the machine",
			"outcome": "TODO",
			"cost": 0,
			"efficacy": 1,
			"time": 1,
			"impact": -1
		}
	]
},
{
	"title": "Slugs",
	"description": "Slugs keep crawling into my unit from under the door to the hallway.",
	"location": "unit",
	"urgent": true,
	"solutions": [
		{
			"action": "Call pest control",
			"outcome": "TODO",
			"cost": 200,
			"efficacy": 8,
			"time": 2,
			"impact": 1
		},
		{
			"action": "Pour salt on the door threshhold",
			"outcome": "TODO",
			"cost": 3,
			"efficacy": 6,
			"time": 1,
			"impact": 0
		},
		{
			"action": "Tell tenant to pour salt on the door threshhold",
			"outcome": "TODO",
			"cost": 0,
			"efficacy": 4,
			"time": 1,
			"impact": -1
		}
	]
},
{
	"title": "Broken window (golfball)",
	"description": "A golfball smashed through the window, shattering most of the pane.",
	"location": "unit",
	"urgent": true,
	"solutions": [
		{
			"action": "Hire a contractor to replace the window pane",
			"outcome": "TODO",
			"cost": 400,
			"efficacy": 10,
			"time": 2,
			"impact": 2
		},
		{
			"action": "Remove remainder of broken pane and replace it with a new one",
			"outcome": "TODO",
			"cost": 60,
			"efficacy": 10,
			"time": 3,
			"impact": 1
		},
		{
			"action": "Tape a piece of clear acrylic over the broken window pane",
			"outcome": "TODO",
			"cost": 20,
			"efficacy": 4,
			"time": 3,
			"impact": -1
		},
		{
			"action": "Tell tenant to put cardboard in the window",
			"outcome": "TODO",
			"cost": 0,
			"efficacy": 1,
			"time": 1,
			"impact": -3
		}
	]
},
{
	"title": "Weird sounds next door",
	"description": "For the last several days I've been hearing strange bustling and whistling sounds coming from next door. When I knock, the sound stops, but no one answers. It isn't a human whistling sound.",
	"location": "unit",
	"urgent": false,
	"solutions": [
		{
			"action": "Investigate the sounds",
			"outcome": "You don't find anything, but you're pretty sure you heard the sounds too and now you're feeling a little uneasy.",
			"cost": 0,
			"efficacy": 1,
			"time": 4,
			"impact": 2
		},
		{
			"action": "Install a white noise machine in the hallway to dampen sound travel",
			"outcome": "That didn't do much, but hey, you can't hear anyone when you run into them in the hallway now.",
			"cost": 180,
			"efficacy": 3,
			"time": 4,
			"impact": 1
		},
		{
			"action": "Suggest the tenant record the sounds and create a loop from the sample.",
			"outcome": "The tenant doesn't seem impressed with the suggestion.",
			"cost": 0,
			"efficacy": 1,
			"time": 1,
			"impact": -1
		}
	]
},
{
	"title": "Lost my key",
	"description": "Hello, I have lost my key and am locked out of my unit. Could you please let me back in?",
	"location": "unit",
	"urgent": true,
	"solutions": [
		{
			"action": "Hire a locksmith to re-key the door",
			"outcome": "You meet the tenant at their door, verify their identity, then call a locksmith to re-key the lock. You keep a copy of the key just in case this tenant locks themself out again.",
			"cost": 120,
			"efficacy": 10,
			"time": 2,
			"impact": 1
		},
		{
			"action": "Look for a copy of their key",
			"outcome": "You spend half the day looking for keys, but cannot find a backup of the tenant's key",
			"cost": 0,
			"efficacy": 0,
			"time": 2,
			"impact": 0
		},
		{
			"action": "Hire a teacher who can help you to 'unlock anything in your life'",
			"outcome": "While the course was interesting and you have a lot to think about, you realize at the end that you're not any closer to being able to unlock any door in the building.",
			"cost": 700,
			"efficacy": 0,
			"time": 6,
			"impact": -1
		},
		{
			"action": "Break down the door",
			"outcome": "You break down the door. The tenant doesn't seem that grateful they're able to get into their unit, but on the positive side, you decide to replace the door, including the lock.",
			"cost": 200,
			"efficacy": 8,
			"time": 3,
			"impact": -1
		}
	]
},
{
	"title": "Refrigerator eating my food",
	"description": "For weeks I have been hearing strange sounds from the kitchen, like plastic mashing together, with growling and grunting and gurgling. It was happening again at 4am today and I went into the kitchen without turning the light on, and that's when I realized that the fridge is eating my food. It also explains why my groceries go so fast...",
	"location": "unit",
	"urgent": false,
	"solutions": [
		{
			"action": "Tell the tenant to only go out to eat for a few weeks to starve the fridge",
			"outcome": "The tenant is reluctant at first, but agrees after learning that their renter's insurance covers the food loss and meals out. They stop bringing groceries home and eventually the refrigerator quiets down.",
			"cost": 0,
			"efficacy": 6, 
			"time": 1,
			"impact": 1
		},
		{
			"action": "Replace the refrigerator",
			"outcome": "Moving the fridge out of the unit is more difficult than you recall it having been in the past. It's heavier and feels ... reluctant, somehow. You hear it gurgling sadly as you put it in the storage closet.",
			"cost": 840,
			"efficacy": 10,
			"time": 3,
			"impact": 1
		},
		{
			"action": "Try baiting the fridge with cheese on the adjacent counter", 
			"outcome": "The cheese disappears by the next day, but nothing else changes.",
			"cost": 12,
			"efficacy": 2,
			"time": 2,
			"impact": 0
		},
		{
			"action": "Stay in the tenant's kitchen to observe the fridge until it eats again",
			"outcome": "After 3 days of occasional low grumbles and growls emanating from the fridge, it finally happens: the plastic mashing builds up, getting louder and louder. You open the door. Half-eaten food and liquid oozes onto the floor. The fridgewhines.",
			"cost": 0,
			"efficacy": 4,
			"time": 11,
			"impact": -2
		}

	]
},
{
	"title": "No electricity in kitchen",
	"description": "When I got home I discovered that my kitchen has no power. The refrigerator, range, and microwave are all dead, and the outlet I usually have my electric kettle plugged into also does not work.",
	"location": "unit",
	"urgent": true,
	"solutions": [
		{
			"action": "Hire an electrician",
			"outcome": "The electrician finds the reversed polarity quickly and re-grounds wires in the master outlet for the kitchen before replacing the outlet itself.",
			"cost": 230,
			"efficacy": 10,
			"time": 4,
			"impact": 2
		},
		{
			"action": "Try to fix the electrical issue yourself",
			"outcome": "TODO",
			"cost": 24,
			"efficacy": 5,
			"time": 5,
			"impact": 1
		},
		{
			"action": "Plaster off the kitchen and provide the tenant with a mini-fridge and portable range",
			"outcome": "The tenant is bewildered and tries to argue with you. You're too busy building up the plaster wall to close off the kitchen to think much about what they're saying.",
			"cost": 300,
			"efficacy": 8,
			"time": 8,
			"impact": -2
		}
}
]
