[
{
	"title": "Sink not draining",
	"description": "The bathroom sink is clogged. It takes 2 hours to drain.",
	"location": "unit",
	"urgent": false,
	"cooldown": 3,
	"solutions": [
		{
			"action": "Call a plumber",
			"outcome": "The plumber deftly unclogs the sink. She remarks that the pipes were lined with a glistening, almost-glowing material, but they're in good condition. The clog itself was typical build-up.",
			"cost": 220,
			"efficacy": 10,
			"time": 4,
			"impact": 1
		},
		{
			"action": "Use a plunger and drano",
			"outcome": "After leaving drano in the sink for several hours and coming back to plunge it, you successfully clear the drain. It's still a little slow, but you tell the tenant it will speed up in the next week.",
			"cost": 40,
			"efficacy": 7,
			"time": 5,
			"impact": 1
		},
		{
			"action": "Just use drano",
			"outcome": "You pick up some drano at the hardware store and pour it in the tenant's sink, then leave.",
			"cost": 15,
			"efficacy": 5,
			"time": 4,
			"impact": 0
		},
		{
			"action": "Tell tenant to use drano",
			"outcome": "The tenant acknowledges your text message.",
			"cost": 0,
		        "efficacy": 4,
			"time": 2,
			"impact": -1
		},
		{
			"action": "Improvise",
			"cost": 0,
			"efficacy": -1,
			"time": 3,
			"impact": -1
		}
	]
},
{
	"title": "Tub handle broken",
	"description": "The hot water handle on the tub has broken off. It can still be turned, but it is difficult due to the lack of a handle. Could you please put a new handle on the tub?",
	"location": "unit",
	"urgent": false,
	"cooldown": 6,
	"solutions": [
		{
			"action": "Replace the entire tub spout",
			"outcome": "The fixture on the tub was pretty old so you aren't able to find an exact replacement, but the new one fits in its place perfectly and it seems to work fine. The tenant thanks you.",
			"cost": 75,
			"efficacy": 10,
			"time": 6,
			"impact": 1
		},
		{
			"action": "Glue a laser pointer in the handle's place",
			"outcome": "This fits perfectly! No one will be able to tell the difference.",
			"cost": 0,
			"efficacy": -1,
			"time": 3,
			"impact": -1
		}
	]
},
{
	"title": "Window is not sealed",
	"description": "The window pane has come out of the frame and is open by about 2 inches at the widest point. Bugs and pests can easily come in.",
	"location": "unit",
	"urgent": true,
	"cooldown": 4,
	"solutions": [
		{
			"action": "Hire a contractor to replace the window",
			"outcome": "The contractor works quickly, but it still takes a few days to get the right replacement and install it. You apologize to the tenant for the inconvenience, but they're grateful it's being fixed.",
			"cost": 1000,
			"efficacy": 10,
			"time": 4,
			"impact": 2
		},
		{
			"action": "Replace the window",
			"outcome": "It's the first time you've replaced a window, but the work is meditative and you're pleased with the end result. You have a deep sense of satisfaction about it. Hopefully it holds up!",
			"cost": 700,
			"efficacy": 6,
			"time": 30,
			"impact": 1
		},
		{
			"action": "Remove window from the sill and caulk the pane back in place",
			"outcome": "It takes a day for the caulk to dry and the end result isn't beautiful, but the tenant can put a curtain over it or something. At least it's sealed now!",
			"cost": 30,
			"efficacy": 4,
			"time": 16,
			"impact": 0
		},
		{
			"action": "Use tape to cover the opening",
			"outcome": "You end up having to buy several types of tape because some of them peel off too easily. You put the blinds down to cover it after you finish the work.",
			"cost": 25,
			"efficacy": 1,
			"time": 3,
			"impact": -2
		}
	]
},
{
	"title": "Washing machine is broken",
	"description": "The leftmost washing machine is broken. You can select settings and insert coins, but when you start it it just fills with water but doesn't spin.",
	"location": "basement",
	"urgent": false,
	"cooldown": 7,
	"solutions": [
		{
			"action": "Call HappyWash to service the machine",
			"outcome": "It takes several calls across a few days, but finally you get through. When they fix the machine they ask if you have bells somewhere in the basement. You're not sure why.",
			"cost": 100,
			"efficacy": 10,
			"time": 5,
			"impact": 1
		},
		{
			"action": "Put an \"Out of Order\" sign on the machine",
			"outcome": "You hastily scrawl out an \"Out of Order\" note and tape it to the broken machine. The tenant sends you a few more texts, mentioning the sign and asking for an update.",
			"cost": 1,
			"efficacy": 0,
			"time": 1,
			"impact": -1
		},
		{
			"action": "Tell tenant to call HappyWash to service the machine",
			"outcome": "The tenant sends you an update every time they try calling HappyWash. Eventually they get through and apparently they don't respond to tenant requests.",
			"cost": 0,
			"efficacy": 1,
			"time": 4,
			"impact": -2
		}
	]
},
{
	"title": "Slugs",
	"description": "Slugs keep crawling into my unit from under the door to the hallway.",
	"location": "unit",
	"urgent": true,
	"cooldown": 2,
	"solutions": [
		{
			"action": "Call pest control",
			"outcome": "Apparently slugs have been everywhere in the city lately! The pest control person regales you with some truly gross tales about the places they've seen slugs. Delightful!",
			"cost": 200,
			"efficacy": 8,
			"time": 7,
			"impact": 1
		},
		{
			"action": "Pour salt on the door threshhold",
			"outcome": "You spend more time than you expect at the grocery store, trying to figure out what type of salt to buy. You pour it in front of the tenant's door and hope for the best.",
			"cost": 3,
			"efficacy": 6,
			"time": 2,
			"impact": 0
		},
		{
			"action": "Tell tenant to pour salt on the door threshhold",
			"outcome": "The tenant seems confused, but they say they'll try it.",
			"cost": 0,
			"efficacy": 4,
			"time": 1,
			"impact": -1
		}
	]
},
{
	"title": "Broken window (golf ball)",
	"description": "A golfball smashed through the window, shattering most of the pane.",
	"location": "unit",
	"urgent": true,
	"cooldown": 4,
	"solutions": [
		{
			"action": "Hire a contractor to replace the window pane",
			"outcome": "The new window looks great! When you notice the contractor pocketing the golf ball she invites you to come to the driving range sometime.",
			"cost": 400,
			"efficacy": 10,
			"time": 3,
			"impact": 2
		},
		{
			"action": "Remove remainder of broken pane and replace it with a new one",
			"outcome": "You probably should have worn protective gloves for this...",
			"cost": 60,
			"efficacy": 10,
			"time": 8,
			"impact": 1
		},
		{
			"action": "Tape a piece of clear acrylic over the broken window pane",
			"outcome": "After you finish placing the clear acrylic, you realize this probably wasn't the best idea. Ah well. Hindsight...",
			"cost": 20,
			"efficacy": 4,
			"time": 6,
			"impact": -1
		},
		{
			"action": "Tell tenant to put cardboard in the window",
			"outcome": "You receive a string of angry (but polite) messages from the tenant.",
			"cost": 0,
			"efficacy": 0,
			"time": 3,
			"impact": -3
		}
	]
},
{
	"title": "Weird sounds next door",
	"description": "For the last several days I've been hearing strange bustling and whistling sounds coming from next door. When I knock, the sound stops, but no one answers. It isn't a human whistling sound.",
	"location": "unit",
	"urgent": false,
	"cooldown": 6,
	"solutions": [
		{
			"action": "Investigate the sounds",
			"outcome": "You don't find anything, but you're pretty sure you heard the sounds too and now you're feeling a little uneasy.",
			"cost": 0,
			"efficacy": 1,
			"time": 7,
			"impact": 2
		},
		{
			"action": "Install a white noise machine in the hallway",
			"outcome": "The sounds are still there, but hey, now you can't hear anyone when you run into them in the hallway.",
			"cost": 180,
			"efficacy": 3,
			"time": 5,
			"impact": 1
		},
		{
			"action": "Suggest the tenant record the sounds to create a sample loop.",
			"outcome": "The tenant doesn't seem impressed with the suggestion.",
			"cost": 0,
			"efficacy": 1,
			"time": 2,
			"impact": -1
		}
	]
},
{
	"title": "Lost my key",
	"description": "Hello, I have lost my key and am locked out of my unit. Could you please let me back in?",
	"location": "unit",
	"urgent": true,
	"cooldown": 8,
	"solutions": [
		{
			"action": "Hire a locksmith to re-key the door",
			"outcome": "You meet the tenant at their door, verify their identity, then call a locksmith to re-key the lock. You keep a copy of the key just in case this tenant locks themself out again.",
			"cost": 120,
			"efficacy": 10,
			"time": 5,
			"impact": 1
		},
		{
			"action": "Look for a copy of their key",
			"outcome": "You spend half the day looking for keys, but cannot find a backup of the tenant's key",
			"cost": 0,
			"efficacy": 0,
			"time": 3,
			"impact": 0
		},
		{
			"action": "Hire a teacher who can help you to 'unlock anything in your life'",
			"outcome": "While the course was interesting and you have a lot to think about, you realize at the end that you're not any closer to being able to unlock any door in the building.",
			"cost": 700,
			"efficacy": 0,
			"time": 10,
			"impact": -1
		},
		{
			"action": "Break down the door",
			"outcome": "You break down the door. The tenant doesn't seem that grateful they're able to get into their unit, but on the positive side, you decide to replace the door, including the lock.",
			"cost": 200,
			"efficacy": 8,
			"time": 6,
			"impact": -1
		}
	]
},
{
	"title": "Refrigerator eating my food",
	"description": "For weeks I have been hearing strange sounds from the kitchen, like plastic mashing together, with growling and grunting and gurgling. It was happening again at 4am today and I went into the kitchen without turning the light on, and that's when I realized that the fridge is eating my food. It also explains why my groceries go so fast...",
	"location": "unit",
	"urgent": false,
	"cooldown": 18,
	"solutions": [
		{
			"action": "Tell the tenant to go out to eat for a while to starve the fridge",
			"outcome": "The tenant is reluctant at first, but agrees after learning that their renter's insurance covers the food loss and meals out. They stop bringing groceries home and eventually the refrigerator quiets down.",
			"cost": 0,
			"efficacy": 6, 
			"time": 3,
			"impact": 1
		},
		{
			"action": "Replace the refrigerator",
			"outcome": "Moving the fridge out of the unit is more difficult than you recall it having been in the past. It's heavier and feels ... reluctant, somehow. You hear it gurgling sadly as you put it in the storage closet.",
			"cost": 840,
			"efficacy": 10,
			"time": 7,
			"impact": 1
		},
		{
			"action": "Try baiting the fridge with cheese", 
			"outcome": "The cheese disappears by the next day, but nothing else changes.",
			"cost": 12,
			"efficacy": 2,
			"time": 4,
			"impact": 0
		},
		{
			"action": "Observe the fridge until it eats again",
			"outcome": "After 3 days of occasional low grumbles and growls emanating from the fridge, it finally happens: the plastic mashing builds up, getting louder and louder. You open the door. Half-eaten food and liquid oozes onto the floor. The fridge whines.",
			"cost": 0,
			"efficacy": 4,
			"time": 14,
			"impact": -2
		}

	]
},
{
	"title": "No electricity in kitchen",
	"description": "When I got home I discovered that my kitchen has no power. The refrigerator, range, and microwave are all dead, and the outlet I usually have my electric kettle plugged into also does not work.",
	"location": "unit",
	"urgent": true,
	"cooldown": 15,
	"solutions": [
		{
			"action": "Hire an electrician",
			"outcome": "The electrician finds the reversed polarity quickly and re-grounds wires in the master outlet for the kitchen before replacing the outlet itself.",
			"cost": 230,
			"efficacy": 10,
			"time": 6,
			"impact": 2
		},
		{
			"action": "Try to fix the electrical issue yourself",
			"outcome": "You try replacing the outlet and it works briefly before melting the cable you plugged into it. After a day and some googling you figure out the polarity is reversed and try fixing it. It seems okay.",
			"cost": 24,
			"efficacy": 5,
			"time": 12,
			"impact": 1
		},
		{
			"action": "Plaster off the kitchen",
			"outcome": "You provide the tenant a mini-fridge and portable range before starting your work. Bewildered, they argue with you, but you're preoccupied with building up the plaster wall and ignore them.",
			"cost": 300,
			"efficacy": 8,
			"time": 15,
			"impact": -2
		}
	]
},
{
	"title": "Window stuck open (rain)",
	"description": "Hi, I opened my window and can't seem to shut it. It's starting to rain, so this is kind of urgent. Thanks.",
	"location": "unit",
	"urgent": true,
	"cooldown": 3,
	"solutions": [
		{
			"action": "Go over to shut the window yourself",
			"outcome": "With effort and grease, you're able to shut the window. The apartment reeks though, and you almost want to reopen the window, just a tiny bit...",
			"cost": 2,
			"efficacy": 8, 
			"time": 7,
			"impact": 1
		},
		{
			"action": "Send another tenant you think is stronger to shut the window",
			"outcome": "You don't hear back from either tenant. It's probably fine.",
			"cost": 0,
			"efficacy": 5,
			"time": 4,
			"impact": -2
		}
	]
},
{
	"title": "No warm water",
	"description": "There is no warm water in my apartment, either coming from the kitchen skin or from either faucet in the bathroom.",
	"location": "unit",
	"urgent": true,
	"cooldown": 6,
	"solutions": [
		{
			"action": "Check the water heater", 
			"outcome": "Looks like someone turned the upper temperature on the heater down by 30%. You turn it back up.",
			"cost": 0,
			"efficacy": 10, 
			"time": 6,
			"impact": 1
		},
		{
			"action": "Suggest the tenant use an electric kettle", 
			"outcome": "The tenant sends you an angry text message. Maybe they don't have a kettle?",
			"cost": 0,
			"efficacy": 0,
			"time": 2,
			"impact": -2
		}
	]
},
{
	"title": "Silkworms",
	"description": "Silkworms have been getting into my apartment! I think they're getting in through a crack in the wall. It's so gross.",
	"location": "unit",
	"urgent": true,
	"cooldown": 5,
	"solutions": [
		{
			"action": "Gift the tenant a potted mulberry tree for their new pets",
			"outcome": "As you hand the tenant the mulberry tree, you explain that mulberry leaves are the main thing that silkworms eat. It is important to keep your silkworms hydrated.",
			"cost": 120,
			"efficacy": 5,
			"time": 5,
			"impact": 0
		},
		{
			"action": "Plaster the crack in the wall", 
			"outcome": "The crack in the wall turns out to be a 5-inch gap. The tenant is lucky they aren't getting bats or something. You plaster it shut as best you can.",
			"cost": 10,
			"efficacy": 5,
			"time": 8,
			"impact": 1
		},
		{
			"action": "Collect the silkworms from the unit",
			"outcome": "One by one, you pluck up the silkworms from the unit, collectin them in a small wicker basket. Some of them climb out, but you coax them back in with mulberry leaves. You thank the tenant when you leave.",
			"cost": 5,
			"efficacy": 5,
			"time": 5,
			"impact": 0
		}
	]
},
{
	"title": "Neighbor teaching yoga in apt",
	"description": "My neighbor is hosting 3-4 yoga classes per day in her apartment! A ton of people are coming and going and it's actually pretty loud. It also just makes it difficult to bring in my groceries or park near the building.",
	"location": "unit",
	"urgent": true,
	"cooldown": 8,
	"solutions": [
		{
			"action": "Give the tenant notice to stop hosting classes",
			"outcome": "You write up a formal letter informing the tenant that they must stop hosting classes. In the letter you mention that there will be a fine to pay if they don't stop immediately. The tenant doesn't acknowledge the note.",
			"cost": 3,
			"efficacy": 8, 
			"time": 7,
			"impact": 1
		},
		{
			"action": "Attend a class",
			"outcome": "You went in expecting to shut down the class afterwards, but the tenant is a great teacher! You consider whether it's in your budget to attend weekly - you did buy nice yoga pants for this, after all.",
			"cost": 135,
			"efficacy": 10,
			"time": 4,
			"impact": 0
		},
		{
			"action": "Attend a class while in disguise",
			"outcome": "You buy an expensive yoga outfit and a cheap wig to wear to the class. The class was excellent, but on the way out you run into the tenant who reported the class while they carry in groceries. They recognize you.",
			"cost": 180,
			"efficacy": 0,
			"time": 18,
			"impact": -2
		}
	]
},
{
	"title": "I'd like a pool!",
	"description": "The summer heat is getting really intense! Could we get a pool installed? Thanks!",
	"location": "building",
	"urgent": false,
	"cooldown": 20,
	"solutions": [
		{
			"action": "Install a small wading pool in front of the building",
			"outcome": "The tenant is underwhelmed. They can't even swim in this! What about another pool behind the building in the parking lot?",
			"cost": 4000,
			"efficacy": 9,
			"time": 20,
			"impact": 0
		},
		{
			"action": "Set up a kiddie pool outside with a hose",
			"outcome": "The tenant seems initially satisfied, until they realize that this is all you plan to do as far as pool installation goes.",
			"cost": 50,
			"efficacy": 4,
			"time": 5,
			"impact": 0
		},
		{
			"action": "Offer to set up timed sprinklers on the lawn",
			"outcome": "It takes far longer than you could have anticipated to set up timed sprinklers, but the effect is magnificent. The tenant had been skeptical at first, but seems satisfied.",
			"cost": 120,
			"efficacy": 10,
			"time": 8,
			"impact": 1
		}
	]
},
{
	"title": "COCKROACHES",
	"description": "An enormous cockroach just crawled out from underneath the fridge. This thing was nearly the size of a kumquat, EW! Please spray the building and get pest control.",
	"location": "unit",
	"urgent": true,
	"cooldown": 10,
	"solutions": [
		{
			"action": "Send pest control",
			"outcome": "Pest control sets out bait traps throughout the building. The tenant is still rattled, but seems contented with the swiftness of your action.",
			"cost": 300,
			"efficacy": 10,
			"time": 5,
			"impact": 1
		},
		{
			"action": "Set bait traps yourself and monitor the situation",
			"outcome": "Either the traps aren't effective or there just weren't that many roaches. It's entirely possible that the cockroach the tenant saw had just been disturbed from its prefered home by nearby construction.",
			"cost": 60,
			"efficacy": 6,
			"time": 6,
			"impact": 1
		},
		{
			"action": "Assure the tenant that those are just palmetto bugs",
			"outcome": "The tenant is skeptical",
			"cost": 0,
			"efficacy": 4,
			"time": 2,
			"impact": -1
		}
	]
},
{
	"title": "Squirrels in the dumpster",
	"description": "A squirrel leapt out of the dumpster and nearly landed on my face when I took out my trash this morning. Could you please get rid of them?!!",
	"location": "dumpster",
	"urgent": true,
	"cooldown": 6,
	"solutions": [
		{
			"action": "Tell the tenant there's nothing you can do, the dumpsters are the city's jurisdiction",
			"outcome": "The tenant doesn't reply",
			"cost": 0,
			"efficacy": 4, 
			"time": 2,
			"impact": -1
		},
		{
			"action": "Hire pest control",
			"outcome": "Pest control comes by to have a look. They can't do much because the squirrels aren't living in the dumpster, but you might want to have your roof checked..",
			"cost": 280,
			"efficacy": 7,
			"time": 5,
			"impact": 0
		},
		{
			"action": "Build a house for the squirrels",
			"outcome": "You build a small house for the squirrels and place it in a nearby tree. You let the tenant know that there's a dedicated habitat for the squirrels and suggest they leave small pieces of food trash near it to entice the squirrels.",
			"cost": 80,
			"efficacy": 6,
			"time": 10,
			"impact": -1
		}
	]
},
{
	"title": "Talking trees",
	"description": "The trees just outside my window (on the side) talk loudly and long into the night. I've tried to shush them, but they don't understand human language. Could you please get them to quiet down while I'm trying to sleep?",
	"location": "grounds",
	"urgent": false,
	"cooldown": 12,
	"solutions": [
		{
			"action": "Hire a witch to ask the trees to respect quiet hours",
			"outcome": "The witch goes to talk to the trees and ends up gossiping with them into the wee hours of the night. At the end she thanks you for inviting her to chat with them, then goes on her way.",
			"cost": 190,
			"efficacy": 4,
			"time": 7,
			"impact": 0
		},
		{
			"action": "Go talk to the trees",
			"outcome": "The trees become quite still as you approach. You try to greet them politely, but they do not respond. After a few hours you give up. From a distance you hear them beginning to whisper again.",
			"cost": 0,
			"efficacy": 2, 
			"time": 6,
			"impact": 1
		},
		{
			"action": "Suggest the tenant take a tree language course",
			"outcome": "When you next hear from the tenant, you find out that the trees have simply been very excited about all the baby birds being born in or near them and like telling them stories late into the night.",
			"cost": 0,
			"efficacy": 8,
			"time": 5,
			"impact": 1
		}
	]
}
]
